---
kind: type
id: T:Autodesk.Revit.DB.Events.ElementTypeDuplicatedEventArgs
source: html/7ec2ef50-ea02-2e47-a854-490d00285cd1.htm
---
# Autodesk.Revit.DB.Events.ElementTypeDuplicatedEventArgs

The event arguments used by the ElementTypeDuplicated event.

## Syntax (C#)
```csharp
public class ElementTypeDuplicatedEventArgs : RevitAPIPostDocEventArgs
```